In [1]:
import pandas as pd
import numpy as np

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
test_df = pd.read_csv('./test_a.csv', sep='\t', nrows=None)

In [3]:
test_df.head()

                                                text
0  5399 3117 1070 4321 4568 2621 5466 3772 4516 2...
1  2491 4109 1757 7539 648 3695 3038 4490 23 7019...
2  2673 5076 6835 2835 5948 5677 3247 4124 2465 5...
3  4562 4893 2210 4761 3659 1324 2595 5949 4583 2...
4  4269 7134 2614 1724 4464 1324 3370 3370 2106 2...

In [4]:
#增加索引列
test_df['id'] = range(len(test_df))

In [5]:
x = set(test_df['id'].tolist())

In [6]:
len(x)

50000

In [7]:
test_df

                                                    text     id
0      5399 3117 1070 4321 4568 2621 5466 3772 4516 2...      0
1      2491 4109 1757 7539 648 3695 3038 4490 23 7019...      1
2      2673 5076 6835 2835 5948 5677 3247 4124 2465 5...      2
3      4562 4893 2210 4761 3659 1324 2595 5949 4583 2...      3
4      4269 7134 2614 1724 4464 1324 3370 3370 2106 2...      4
...                                                  ...    ...
49995  3725 4498 2282 1647 6293 4245 4498 3615 1141 2...  49995
49996  4811 465 3800 1394 3038 2376 2327 5165 3070 57...  49996
49997  5338 1952 3117 4109 299 6656 6654 3792 6831 21...  49997
49998  893 3469 5775 584 2490 4223 6569 6663 2124 168...  49998
49999  2400 4409 4412 2210 5122 4464 7186 2465 1327 9...  49999

[50000 rows x 2 columns]

In [8]:
# 统计每类新闻字符个数
test_df['text_len'] = test_df['text'].apply(lambda x: len(x.split(' ')))

In [9]:
test_df

                                                    text     id  text_len
0      5399 3117 1070 4321 4568 2621 5466 3772 4516 2...      0       607
1      2491 4109 1757 7539 648 3695 3038 4490 23 7019...      1      1861
2      2673 5076 6835 2835 5948 5677 3247 4124 2465 5...      2       901
3      4562 4893 2210 4761 3659 1324 2595 5949 4583 2...      3      3786
4      4269 7134 2614 1724 4464 1324 3370 3370 2106 2...      4       316
...                                                  ...    ...       ...
49995  3725 4498 2282 1647 6293 4245 4498 3615 1141 2...  49995       275
49996  4811 465 3800 1394 3038 2376 2327 5165 3070 57...  49996       858
49997  5338 1952 3117 4109 299 6656 6654 3792 6831 21...  49997       299
49998  893 3469 5775 584 2490 4223 6569 6663 2124 168...  49998       470
49999  2400 4409 4412 2210 5122 4464 7186 2465 1327 9...  49999       245

[50000 rows x 3 columns]

In [10]:
test_df['text_len'].describe()
#最短14

count    50000.000000
mean       909.844960
std       1032.313375
min         14.000000
25%        370.000000
50%        676.000000
75%       1133.000000
max      41861.000000
Name: text_len, dtype: float64

In [11]:
test_df[test_df['text_len']==14]

                                                    text     id  text_len
649    2289 6357 2109 4139 248 3193 4595 1148 3397 30...    649        14
5081   3366 6407 932 2848 2400 3870 3242 2685 4490 42...   5081        14
39409  1141 473 1407 4802 7539 3961 1227 2380 5689 68...  39409        14

In [12]:
test_df[test_df['id']==469]

                                                  text   id  text_len
469  2851 2119 5226 4301 1018 3586 7539 5589 1667 4...  469       256

In [13]:
test_df[test_df['id']==6550]

                                                   text    id  text_len
6550  4139 5410 7539 1987 1334 5623 1397 7261 7408 6...  6550      1310

In [34]:
test_df[test_df['id']==7799]
test_df[test_df['id']==7560]
test_df[test_df['id']==18566]
test_df[test_df['id']==10801]

                                                   text    id  text_len
7799  1141 2828 5381 1388 6831 3396 7539 1141 2828 5...  7799       256

                                                   text    id  text_len
7560  6501 3366 1363 1735 6663 1832 3772 6835 5296 7...  7560       256

                                                    text     id  text_len
18566  5562 2828 4559 2456 4490 3530 3312 6093 1699 1...  18566       256

                                                    text     id  text_len
10801  7445 3151 307 5631 5096 2539 3661 5036 2364 22...  10801      2345

In [44]:
max_segment_length = 256
text_len =512
idx = list(range(0, text_len + 1, max_segment_length))

other_len = text_len % max_segment_length
#因为测试集最短为14， 所以min 14
if other_len >= 14:
    idx.append(text_len)

In [45]:
idx

[0, 256, 512]

In [37]:
test_df_cp = test_df.copy()

In [38]:
test_df_cp

                                                    text     id  text_len
0      5399 3117 1070 4321 4568 2621 5466 3772 4516 2...      0       607
1      2491 4109 1757 7539 648 3695 3038 4490 23 7019...      1      1861
2      2673 5076 6835 2835 5948 5677 3247 4124 2465 5...      2       901
3      4562 4893 2210 4761 3659 1324 2595 5949 4583 2...      3      3786
4      4269 7134 2614 1724 4464 1324 3370 3370 2106 2...      4       316
...                                                  ...    ...       ...
49995  3725 4498 2282 1647 6293 4245 4498 3615 1141 2...  49995       275
49996  4811 465 3800 1394 3038 2376 2327 5165 3070 57...  49996       858
49997  5338 1952 3117 4109 299 6656 6654 3792 6831 21...  49997       299
49998  893 3469 5775 584 2490 4223 6569 6663 2124 168...  49998       470
49999  2400 4409 4412 2210 5122 4464 7186 2465 1327 9...  49999       245

[50000 rows x 3 columns]

In [39]:
test_df_cp['text_ls'] = test_df_cp['text'].apply(lambda x: np.array(x.split(' ')))

In [40]:
test_df_cp

,text,id,text_len,text_ls
0,5399 3117 1070 4321 4568 2621 5466 3772 4516 2...,0,607,"[5399, 3117, 1070, 4321, 4568, 2621, 5466, 377..."
1,2491 4109 1757 7539 648 3695 3038 4490 23 7019...,1,1861,"[2491, 4109, 1757, 7539, 648, 3695, 3038, 4490..."
2,2673 5076 6835 2835 5948 5677 3247 4124 2465 5...,2,901,"[2673, 5076, 6835, 2835, 5948, 5677, 3247, 412..."
3,4562 4893 2210 4761 3659 1324 2595 5949 4583 2...,3,3786,"[4562, 4893, 2210, 4761, 3659, 1324, 2595, 594..."
4,4269 7134 2614 1724 4464 1324 3370 3370 2106 2...,4,316,"[4269, 7134, 2614, 1724, 4464, 1324, 3370, 337..."
...,...,...,...,...
49995,3725 4498 2282 1647 6293 4245 4498 3615 1141 2...,49995,275,"[3725, 4498, 2282, 1647, 6293, 4245, 4498, 361..."
49996,4811 465 3800 1394 3038 2376 2327 5165 3070 57...,49996,858,"[4811, 465, 3800, 1394, 3038, 2376, 2327, 5165..."
49997,5338 1952 3117 4109 299 6656 6654 3792 6831 21...,49997,299,"[5338, 1952, 3117, 4109, 299, 6656, 6654, 3792..."
49998,893 3469 5775 584 2490 4223 6569 6663 2124 168...,49998,470,"[893, 3469, 5775, 584, 2490, 4223, 6569, 6663,..."
49999,2400 4409 4412 2210 5122 4464 7186 2465 1327 9...,49999,245,"[2400, 4409, 4412, 2210, 5122, 4464, 7186, 246..."

In [41]:
test_df_cp[test_df_cp['text_len']==14]
#长度为14的数据, 这是最短的数据

,text,id,text_len,text_ls
649,2289 6357 2109 4139 248 3193 4595 1148 3397 30...,649,14,"[2289, 6357, 2109, 4139, 248, 3193, 4595, 1148..."
5081,3366 6407 932 2848 2400 3870 3242 2685 4490 42...,5081,14,"[3366, 6407, 932, 2848, 2400, 3870, 3242, 2685..."
39409,1141 473 1407 4802 7539 3961 1227 2380 5689 68...,39409,14,"[1141, 473, 1407, 4802, 7539, 3961, 1227, 2380..."

In [42]:
from tqdm import tqdm
add_tf = pd.DataFrame()
max_segment_length = 256

In [43]:
for index, row in tqdm(test_df_cp.iterrows(), total=50000 ):
    txid = row['id']
    text = row['text_ls']
    text_len = row['text_len']
    
    idx = list(range(0, text_len + 1, max_segment_length))
    
    other_len = text_len % max_segment_length
    #因为测试集最短为14， 所以min 14
    if other_len >= 14:
        idx.append(text_len)
    
    for i in range(len(idx) - 1):
        segment = text[idx[i]: idx[i+1]]
        segdata = {"id":txid,"text":segment}
        add_tf = add_tf.append(segdata,ignore_index=True)

100%|██████████| 50000/50000 [14:16<00:00, 58.35it/s]

In [46]:
add_tf_cp =add_tf.copy()

In [47]:
add_tf.head()

    id                                               text
0  0.0  [5399, 3117, 1070, 4321, 4568, 2621, 5466, 377...
1  0.0  [4700, 6662, 3018, 5957, 6656, 2477, 648, 7543...
2  0.0  [1511, 7467, 6065, 3370, 4230, 6644, 6065, 365...
3  1.0  [2491, 4109, 1757, 7539, 648, 3695, 3038, 4490...
4  1.0  [4269, 4704, 2522, 5948, 3335, 3310, 900, 1985...

In [48]:
add_tf

             id                                               text
0           0.0  [5399, 3117, 1070, 4321, 4568, 2621, 5466, 377...
1           0.0  [4700, 6662, 3018, 5957, 6656, 2477, 648, 7543...
2           0.0  [1511, 7467, 6065, 3370, 4230, 6644, 6065, 365...
3           1.0  [2491, 4109, 1757, 7539, 648, 3695, 3038, 4490...
4           1.0  [4269, 4704, 2522, 5948, 3335, 3310, 900, 1985...
...         ...                                                ...
200289  49997.0  [5338, 1952, 3117, 4109, 299, 6656, 6654, 3792...
200290  49997.0  [433, 5410, 764, 7543, 5328, 1699, 803, 5909, ...
200291  49998.0  [893, 3469, 5775, 584, 2490, 4223, 6569, 6663,...
200292  49998.0  [7387, 394, 4811, 803, 1351, 5718, 4278, 4893,...
200293  49999.0  [2400, 4409, 4412, 2210, 5122, 4464, 7186, 246...

[200294 rows x 2 columns]

In [49]:
add_tf_cp['text'] = add_tf_cp['text'].apply(lambda x: ' '.join(x))

In [50]:
add_tf_cp

             id                                               text
0           0.0  5399 3117 1070 4321 4568 2621 5466 3772 4516 2...
1           0.0  4700 6662 3018 5957 6656 2477 648 7543 6930 22...
2           0.0  1511 7467 6065 3370 4230 6644 6065 3659 4230 1...
3           1.0  2491 4109 1757 7539 648 3695 3038 4490 23 7019...
4           1.0  4269 4704 2522 5948 3335 3310 900 1985 7194 75...
...         ...                                                ...
200289  49997.0  5338 1952 3117 4109 299 6656 6654 3792 6831 21...
200290  49997.0  433 5410 764 7543 5328 1699 803 5909 974 1635 ...
200291  49998.0  893 3469 5775 584 2490 4223 6569 6663 2124 168...
200292  49998.0  7387 394 4811 803 1351 5718 4278 4893 1635 452...
200293  49999.0  2400 4409 4412 2210 5122 4464 7186 2465 1327 9...

[200294 rows x 2 columns]

In [24]:
add_tf_cp[add_tf_cp['id']==649]

         id                                               text
2548  649.0  2289 6357 2109 4139 248 3193 4595 1148 3397 30...

In [51]:
add_tf_cp[add_tf_cp['id']==5081]

           id                                               text
20088  5081.0  3366 6407 932 2848 2400 3870 3242 2685 4490 42...

In [52]:
#469不见了
add_tf_cp[add_tf_cp['id']==469]

         id                                               text
1861  469.0  2851 2119 5226 4301 1018 3586 7539 5589 1667 4...

In [53]:
listadd=set(add_tf_cp['id'].tolist())

In [54]:
len(listadd)

50000

In [55]:
add_tf_cp.id=add_tf_cp.id.astype(int)

In [56]:
#add_tf_cp = add_tf_cp.reindex(columns=['id','text'])

In [57]:
add_tf_cp

           id                                               text
0           0  5399 3117 1070 4321 4568 2621 5466 3772 4516 2...
1           0  4700 6662 3018 5957 6656 2477 648 7543 6930 22...
2           0  1511 7467 6065 3370 4230 6644 6065 3659 4230 1...
3           1  2491 4109 1757 7539 648 3695 3038 4490 23 7019...
4           1  4269 4704 2522 5948 3335 3310 900 1985 7194 75...
...       ...                                                ...
200289  49997  5338 1952 3117 4109 299 6656 6654 3792 6831 21...
200290  49997  433 5410 764 7543 5328 1699 803 5909 974 1635 ...
200291  49998  893 3469 5775 584 2490 4223 6569 6663 2124 168...
200292  49998  7387 394 4811 803 1351 5718 4278 4893 1635 452...
200293  49999  2400 4409 4412 2210 5122 4464 7186 2465 1327 9...

[200294 rows x 2 columns]

In [58]:
add_tf_cp.to_csv('./testplus.csv', sep='\t',index=False)

In [29]:
!pwd

/home/nx296/kaggle/news/input